## **[MySQL IS NULL](https://www.mysqltutorial.org/mysql-is-null/)**

Use the MySQL IS NULL operator to test whether a value is NULL or not.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL IS NULL operator

In [3]:
string = '''
SELECT 
    1 IS NULL, 0 IS NULL, NULL IS NULL,
    1 IS NOT NULL, 0 IS NOT NULL, NULL IS NOT NULL
;'''

pd.read_sql(string, engine)

,1 IS NULL,0 IS NULL,NULL IS NULL,1 IS NOT NULL,0 IS NOT NULL,NULL IS NOT NULL
0,0,0,1,1,1,0

### MySQL IS NULL examples

Find customers who do not have a sales representative

In [4]:
# %%timeit
string = '''
SELECT customerName, country, salesRepEmployeeNumber
FROM customers
WHERE salesRepEmployeeNumber IS NULL
ORDER BY customerName
;'''

df1 = pd.read_sql(string, engine)

In [5]:
# %%timeit
df2 = (
    pd.read_sql_table('customers', engine)
    .query('salesRepEmployeeNumber.isna()')
    [['customerName', 'country', 'salesRepEmployeeNumber']]
    .sort_values(by='customerName', ignore_index=True)
)

In [6]:
(df1
 .assign(salesRepEmployeeNumber = df1.salesRepEmployeeNumber.astype('float'))
 .equals(df2)
)

True

In [7]:
df2.head()

,customerName,country,salesRepEmployeeNumber
0,ANG Resellers,Spain,NaN
1,"Anton Designs, Ltd.",Spain,NaN
2,"Asian Shopping Network, Co",Singapore,NaN
3,"Asian Treasures, Inc.",Ireland,NaN
4,BG&E Collectables,Switzerland,NaN

- Get a customer who has a sales representative

In [8]:
# %%timeit
string = '''
SELECT customerName, country, salesRepEmployeeNumber
FROM customers
WHERE salesRepEmployeeNumber IS NOT NULL
ORDER BY customerName
;'''

df1 = pd.read_sql(string, engine)

In [9]:
# %%timeit
df2 = (
    pd.read_sql_table('customers', engine)
    .query('~ salesRepEmployeeNumber.isna()')
    [['customerName', 'country', 'salesRepEmployeeNumber']]
    .sort_values(
        by='customerName', 
        key = lambda col: col.str.upper(),
        ignore_index=True)
)

In [10]:
df1.equals(df2)

False

In [11]:
(df1
 .assign(salesRepEmployeeNumber = df1.salesRepEmployeeNumber.astype(float))
 .equals(df2))

True

In [12]:
df1.head()

              customerName    country  salesRepEmployeeNumber
0             Alpha Cognac     France                    1370
1   American Souvenirs Inc        USA                    1286
2       Amica Models & Co.      Italy                    1401
3  Anna's Decorations, Ltd  Australia                    1611
4        Atelier graphique     France                    1370